htibosch/cyclone_freertos/FreeRTOS/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32F_noncube/NetworkInterface.c
/*
 * Description of all capabilities that can be advertised to
 * the peer (usually a switch or router).
 */
#define ADVERTISE_CSMA			0x0001		// Only selector supported
#define ADVERTISE_10HALF		0x0020		// Try for 10mbps half-duplex
#define ADVERTISE_10FULL		0x0040		// Try for 10mbps full-duplex
#define ADVERTISE_100HALF		0x0080		// Try for 100mbps half-duplex
#define ADVERTISE_100FULL		0x0100		// Try for 100mbps full-duplex

#define ADVERTISE_ALL			( ADVERTISE_10HALF | ADVERTISE_10FULL | \
								  ADVERTISE_100HALF | ADVERTISE_100FULL)

/*
 * Value for the 'PHY_REG_00_BMCR', the PHY's Basic mode control register
 */
#define BMCR_FULLDPLX			0x0100		// Full duplex
#define BMCR_ANRESTART			0x0200		// Auto negotiation restart
#define BMCR_ANENABLE			0x1000		// Enable auto negotiation
#define BMCR_SPEED100			0x2000		// Select 100Mbps
#define BMCR_RESET				0x8000		// Reset the PHY

#define PHYCR_MDIX_EN			0x8000		// Enable Auto MDIX
#define PHYCR_MDIX_FORCE		0x4000		// Force MDIX crossed

#define ipFRAGMENT_OFFSET_BIT_MASK		( ( uint16_t ) 0x0fff ) /* The bits in the two byte IP header field that make up the fragment offset value. */

/*
 * Most users will want a PHY that negotiates about
 * the connection properties: speed, dmix and duplex.
 * On some rare cases, you want to select what is being
 * advertised, properties like MDIX and duplex.
 */

#if !defined( ipconfigETHERNET_AN_ENABLE )
	/* Enable auto-negotiation */
	#define ipconfigETHERNET_AN_ENABLE				1
#endif

#if !defined( ipconfigETHERNET_AUTO_CROSS_ENABLE )
	#define ipconfigETHERNET_AUTO_CROSS_ENABLE		1
#endif

#if( ipconfigETHERNET_AN_ENABLE == 0 )
	/*
	 * The following three defines are only used in case there
	 * is no auto-negotiation.
	 */
	#if !defined( ipconfigETHERNET_CROSSED_LINK )
		#define	ipconfigETHERNET_CROSSED_LINK			1
	#endif

	#if !defined( ipconfigETHERNET_USE_100MB )
		#define ipconfigETHERNET_USE_100MB				1
	#endif

	#if !defined( ipconfigETHERNET_USE_FULL_DUPLEX )
		#define ipconfigETHERNET_USE_FULL_DUPLEX		1
	#endif
#endif /* ipconfigETHERNET_AN_ENABLE == 0 */

/* Default the size of the stack used by the EMAC deferred handler task to twice
the size of the stack used by the idle task - but allow this to be overridden in
FreeRTOSConfig.h as configMINIMAL_STACK_SIZE is a user definable constant. */
#ifndef configEMAC_TASK_STACK_SIZE
	#define configEMAC_TASK_STACK_SIZE ( 2 * configMINIMAL_STACK_SIZE )
#endif

#if ETH_TX_BUF_SIZE != ETH_MAX_PACKET_SIZE || ETH_MAX_PACKET_SIZE < 1536
	#error Not bigger ?
#endif

/*-----------------------------------------------------------*/

/*
 * A deferred interrupt handler task that processes
 */
static void prvEMACHandlerTask( void *pvParameters );

/*
 * Force a negotiation with the Switch or Router and wait for LS.
 */
static void prvEthernetUpdateConfig( BaseType_t xForce );

/*
 * See if there is a new packet and forward it to the IP-task.
 */
static BaseType_t prvNetworkInterfaceInput( void );

/*
 * Check if a given packet should be accepted.
 */
static BaseType_t xMayAcceptPacket( uint8_t *pcBuffer );

void  ETH_BSP_Config(void);

#if( ipconfigZERO_COPY_RX_DRIVER != 0 )
	static void vSetRXBuffers( void );
#endif /* ipconfigZERO_COPY_RX_DRIVER */

#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
	static void vClearTXBuffers( void );
#endif /* ipconfigZERO_COPY_TX_DRIVER */

/*-----------------------------------------------------------*/

typedef struct _PhyProperties_t
{
	uint8_t speed;
	uint8_t mdix;
	uint8_t duplex;
	uint8_t spare;
} PhyProperties_t;

/* Bit map of outstanding ETH interrupt events for processing.  Currently only
the Rx interrupt is handled, although code is included for other events to
enable future expansion. */
static volatile uint32_t ulISREvents;

/* A copy of PHY register 1: 'PHY_REG_01_BMSR' */
static uint32_t ulPHYLinkStatus = 0;

#if( ipconfigUSE_LLMNR == 1 )
	static const uint8_t xLLMNR_MACAddress[] = { 0x01, 0x00, 0x5E, 0x00, 0x00, 0xFC };
#endif

/* Ethernet handle. */
ETH_InitTypeDef ETH_InitStructure;

static BaseType_t xFirstTransmit;

#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
	static SemaphoreHandle_t xTXDescriptorSemaphore = NULL;
#endif /* ipconfigZERO_COPY_TX_DRIVER */

/* Ethernet Rx & Tx DMA Descriptors */
extern ETH_DMADESCTypeDef  DMARxDscrTab[ ETH_RXBUFNB ], DMATxDscrTab[ ETH_TXBUFNB ];

#if( ipconfigZERO_COPY_RX_DRIVER == 0 )
	/* Ethernet Driver Receive buffers  */
	extern uint8_t Rx_Buff[ ETH_RXBUFNB ][ ETH_RX_BUF_SIZE ]; 
#endif

#if( ipconfigZERO_COPY_TX_DRIVER == 0 )
	/* Ethernet Driver Transmit buffers */
	extern uint8_t Tx_Buff[ ETH_TXBUFNB ][ ETH_TX_BUF_SIZE ]; 
#endif

/* Global pointers to track current transmit and receive descriptors */
extern __IO ETH_DMADESCTypeDef  *DMATxDescToSet;
extern __IO ETH_DMADESCTypeDef  *DMARxDescToGet;

#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
	static __IO ETH_DMADESCTypeDef  *DMATxDescToClear;
#endif

/* Global pointer for last received frame infos */
extern ETH_DMA_Rx_Frame_infos *DMA_RX_FRAME_infos;

/* Value to be written into the 'Basic mode Control Register'. */
static uint32_t ulBCRvalue;

/* Value to be written into the 'Advertisement Control Register'. */
static uint32_t ulACRValue;

/* ucMACAddress as it appears in main.c */
extern uint8_t ucMACAddress[ 6 ];

/* Holds the handle of the task used as a deferred interrupt processor.  The
handle is used so direct notifications can be sent to the task for all EMAC/DMA
related interrupts. */
static TaskHandle_t xEMACTaskHandle = NULL;

/* For local use only: describe the PHY's properties: */
const PhyProperties_t xPHYProperties =
{
	#if( ipconfigETHERNET_AN_ENABLE != 0 )
		.speed = PHY_SPEED_AUTO,
		.duplex = PHY_DUPLEX_AUTO,
	#else
		#if( ipconfigETHERNET_USE_100MB != 0 )
			.speed = PHY_SPEED_100,
		#else
			.speed = PHY_SPEED_10,
		#endif

		#if( ipconfigETHERNET_USE_FULL_DUPLEX != 0 )
			.duplex = PHY_DUPLEX_FULL,
		#else
			.duplex = PHY_DUPLEX_HALF,
		#endif
	#endif

	#if( ipconfigETHERNET_AN_ENABLE != 0 ) && ( ipconfigETHERNET_AUTO_CROSS_ENABLE != 0 )
		.mdix = PHY_MDIX_AUTO,
	#elif( ipconfigETHERNET_CROSSED_LINK != 0 )
		.mdix = PHY_MDIX_CROSSED,
	#else
		.mdix = PHY_MDIX_DIRECT,
	#endif
};

/*-----------------------------------------------------------*/

/**
  * @brief  This function handles ethernet DMA interrupt request.
  * @param  None
  * @retval None
  */
void ETH_IRQHandler(void)
{
BaseType_t xHigherPriorityTaskWoken = pdFALSE;
uint32_t ulDMASR = ETH->DMASR & ETH_DMA_ALL_INTS;

	/* Frame received */
	if( ( ulDMASR & ETH_DMA_IT_R ) != 0 )
	{
		ulISREvents |= EMAC_IF_RX_EVENT;
		/* Wakeup the prvEMACHandlerTask. */
		if( xEMACTaskHandle != NULL )
		{
			vTaskNotifyGiveFromISR( xEMACTaskHandle, &xHigherPriorityTaskWoken );
		}
	}

	/* Frame sent */
	if( ( ulDMASR & ETH_DMA_IT_T ) != 0 )
	{
		ulISREvents |= EMAC_IF_TX_EVENT;
		/* Wakeup the prvEMACHandlerTask. */
		if( xEMACTaskHandle != NULL )
		{
			vTaskNotifyGiveFromISR( xEMACTaskHandle, &xHigherPriorityTaskWoken );
		}
	}

	/* Clear all interrupt flags. */
	ETH->DMASR = ulDMASR;

	/* Switch tasks if necessary. */	
	portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
}
/*-----------------------------------------------------------*/

#if( ipconfigZERO_COPY_RX_DRIVER != 0 )
	static void vSetRXBuffers()
	{
	BaseType_t xIndex;
	ETH_DMADESCTypeDef *pxDescriptor = DMARxDscrTab;
	ETH_DMADESCTypeDef *xLastDescriptor = DMARxDscrTab + ETH_RXBUFNB;

