htibosch/cyclone_freertos/FreeRTOS/FreeRTOS-Plus-TCP/portable/NetworkInterface/STM32F_noncube/NetworkInterface.c
		/* Fill each pxDescriptor descriptor with the right values */
		for( xIndex = 0; pxDescriptor < xLastDescriptor; xIndex++, pxDescriptor++ )
		{
			/* Set Buffer1 size and Second Address Chained bit */
			pxDescriptor->ControlBufferSize = ETH_DMARxDesc_RCH | (uint32_t)ETH_RX_BUF_SIZE;  

			/* Set Buffer1 address pointer */
			NetworkBufferDescriptor_t *pxBuffer = pxGetNetworkBufferWithDescriptor( ETH_RX_BUF_SIZE, 100ul );
			if( pxBuffer == NULL )
			{
				break;
			}
			else
			{
				pxDescriptor->Buffer1Addr = (uint32_t)pxBuffer->pucEthernetBuffer;
				pxDescriptor->Status |= ETH_DMARxDesc_OWN;
			}
		}
	}
#endif /* ipconfigZERO_COPY_RX_DRIVER */
/*-----------------------------------------------------------*/

#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
	static void vClearTXBuffers()
	{
	__IO ETH_DMADESCTypeDef  *txLastDescriptor = DMATxDescToSet;
	NetworkBufferDescriptor_t *pxNetworkBuffer;
	uint8_t *ucPayLoad;

		while( ( DMATxDescToClear->Status & ETH_DMATxDesc_OWN ) == 0 )
		{
			if( DMATxDescToClear == txLastDescriptor )
			{
				break;
			}

			ucPayLoad = ( uint8_t * )DMATxDescToClear->Buffer1Addr;

			if( ucPayLoad != NULL )
			{
				pxNetworkBuffer = pxPacketBuffer_to_NetworkBuffer( ucPayLoad );
				if( pxNetworkBuffer != NULL )
				{
					vReleaseNetworkBufferAndDescriptor( pxNetworkBuffer ) ;
				}
				DMATxDescToClear->Buffer1Addr = ( uint32_t )0u;
			}
			/* Tell the counting semaphore that one more TX descriptor is available. */
			#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
			{
				xSemaphoreGive( xTXDescriptorSemaphore );
			}
			#endif /* ipconfigZERO_COPY_TX_DRIVER */
			

			DMATxDescToClear = ( ETH_DMADESCTypeDef * )( DMATxDescToClear->Buffer2NextDescAddr );
		}
	}
#endif /* ipconfigZERO_COPY_TX_DRIVER */
/*-----------------------------------------------------------*/

BaseType_t xNetworkInterfaceInitialise( void )
{
BaseType_t xResult;
	if( xEMACTaskHandle == NULL )
	{
		#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
		{
			if( xTXDescriptorSemaphore == NULL )
			{
				xTXDescriptorSemaphore = xSemaphoreCreateCounting( ( UBaseType_t ) ETH_TXBUFNB - 1, ( UBaseType_t ) ETH_TXBUFNB - 1 );
				configASSERT( xTXDescriptorSemaphore );
			}
		}
		#endif /* ipconfigZERO_COPY_TX_DRIVER */

		/* configure ethernet (GPIOs, clocks, MAC, DMA) */ 
		ETH_BSP_Config();

		#if( ipconfigZERO_COPY_TX_DRIVER == 0 )
		{
			/* Initialize Tx Descriptors list: Chain Mode */
			ETH_DMATxDescChainInit( DMATxDscrTab, Tx_Buff[0], ETH_TXBUFNB );
		}
		#else
		{
			/* Initialize Tx Descriptors list: Chain Mode */
			ETH_DMATxDescChainInit( DMATxDscrTab, NULL, ETH_TXBUFNB );
			DMATxDescToClear = DMATxDscrTab;
		}
		#endif /* ipconfigZERO_COPY_TX_DRIVER */

		#if( ipconfigZERO_COPY_RX_DRIVER == 0 )
		{
			/* Initialize Rx Descriptors list: Chain Mode  */
			ETH_DMARxDescChainInit( DMARxDscrTab, Rx_Buff[0], ETH_RXBUFNB );
		}
		#else
		{
			/* Initialize Rx Descriptors list: Chain Mode  */
			ETH_DMARxDescChainInit( DMARxDscrTab, NULL, ETH_RXBUFNB );
			/* Created enough Network Buffers. */
			vSetRXBuffers();
		}
		#endif /* ipconfigZERO_COPY_RX_DRIVER */
		/* Enable Ethernet Rx interrrupt */
		{
		BaseType_t xIndex;

			for( xIndex=0; xIndex<ETH_RXBUFNB; xIndex++ )
			{
				ETH_DMARxDescReceiveITConfig( &DMARxDscrTab[xIndex], ENABLE );
			}
		}

		#ifdef CHECKSUM_BY_HARDWARE
		/* Enable the checksum insertion for the Tx frames */
		{
		BaseType_t xIndex;

			for( xIndex=0; xIndex<ETH_TXBUFNB; xIndex++ )
			{
				ETH_DMATxDescChecksumInsertionConfig( &DMATxDscrTab[xIndex], ETH_DMATxDesc_ChecksumTCPUDPICMPFull );
			}
		} 
		#endif

		/* Force a negotiation with the Switch or Router and wait for LS. */
		prvEthernetUpdateConfig( pdTRUE );

		/* The deferred interrupt handler task is created at the highest
		possible priority to ensure the interrupt handler can return directly
		to it.  The task's handle is stored in xEMACTaskHandle so interrupts can
		notify the task when there is something to process. */
		xTaskCreate( prvEMACHandlerTask, "EMAC", configEMAC_TASK_STACK_SIZE, NULL, configMAX_PRIORITIES - 1, &xEMACTaskHandle );
	}
	if( ( ulPHYLinkStatus & BMSR_LINK_STATUS ) != 0 )
	{
		//ETH_DMAITConfig( ETH_DMA_ALL_INTS, ENABLE );
	    ETH->DMAIER |= ETH_DMA_ALL_INTS;
		xResult = pdPASS;
		xFirstTransmit = pdTRUE;
		FreeRTOS_printf( ( "Link Status is high\n" ) ) ;
	}
	else
	{
		xResult = pdFAIL;
		FreeRTOS_printf( ( "Link Status still low\n" ) ) ;
	}
	/* When returning non-zero, the stack will become active and
    start DHCP (in configured) */
	return xResult;
}
/*-----------------------------------------------------------*/

BaseType_t xNetworkInterfaceOutput( NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t bReleaseAfterSend )
{
BaseType_t xReturn = pdFAIL;
uint32_t ulTransmitSize = 0;
__IO ETH_DMADESCTypeDef *pxDmaTxDesc;
#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
	const TickType_t xBlockTimeTicks = pdMS_TO_TICKS( 1000u );
#endif

	#if( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM != 0 )
	{
	ProtocolPacket_t *pxPacket;

		/* If the peripheral must calculate the checksum, it wants
		the protocol checksum to have a value of zero. */
		pxPacket = ( ProtocolPacket_t * ) ( pxDescriptor->pucEthernetBuffer );

		if( pxPacket->xICMPPacket.xIPHeader.ucProtocol == ipPROTOCOL_ICMP )
		{
			pxPacket->xICMPPacket.xICMPHeader.usChecksum = ( uint16_t )0u;
		}
	}
	#endif

	/* Open a do {} while ( 0 ) loop to be able to call break. */
	do
	{
		if( ( ulPHYLinkStatus & BMSR_LINK_STATUS ) != 0 )
		{
			#if( ipconfigZERO_COPY_TX_DRIVER != 0 )
			{
				if( xTXDescriptorSemaphore == NULL )
				{
					break;
				}
				if( xSemaphoreTake( xTXDescriptorSemaphore, xBlockTimeTicks ) != pdPASS )
				{
					FreeRTOS_printf( ( "emacps_send_message: Time-out waiting for TX buffer\n" ) );
					break;
				}
			}
			#endif /* ipconfigZERO_COPY_TX_DRIVER */

			/* This function does the actual transmission of the packet. The packet is
			contained in 'pxDescriptor' that is passed to the function. */
			pxDmaTxDesc = DMATxDescToSet;

			/* Is this buffer available? */
			if( ( pxDmaTxDesc->Status & ETH_DMATxDesc_OWN ) == 0 )
			{
				/* Is this buffer available? */
				/* Get bytes in current buffer. */
				ulTransmitSize = pxDescriptor->xDataLength;

